larshei/msp430-libraries/msp430g2553/SSD1306.c
void display_setStartColumn(unsigned short n){
	I2C_setSlaveAdress(0x3C);
	I2C_writeRegister(0, 0x00+n%16);
	I2C_writeRegister(0, 0x10+n/16);
}

void display_clear() {
	int i, j;
	for (i=0; i<8; i++)
	{
		display_setStartPage(i);
		for (j=0; j<128; j++){
			I2C_writeRegister(0x40, 0);
		}
	}
}

void display_init(){
	I2C_setSlaveAdress(0x3C);
	__delay_cycles(300);
	I2C_sendData((unsigned short*)displayInitArray, INIT_COUNT);
}

int display_sendPrepare(char sendMe[], int count, short dynamic)
{
	int j, h, intBufCtr;		// Zählvariablen
	int add = 0;				// Offset zur Berücksichtigung veränderter Stringlängen bei Ersetzen
	char nextChar;				// nächstes zu setzendes Zeichen
	char intBuf[8];				// Buffer für int zur späteren Umkehrung, da diese beim zerlegen Rückwärts abgearbeitet werden

	int tempP;					// werden zur Bearbeitung von Druck und Temperaturwerten genutzt

	for (j=24; j>=0; j--)		// Leer machen
	{	UARTfinalString[j-1] = 0;
	}

	for (j = 0; j < count; j++) //Läuft alle Zeichen des Strings ab
	{	if (((sendMe[j - 1] == '%'))) // P gefunden? war es ein %P?
		{	intBufCtr = 0;		// Ziffernzahl zurücksetzen
			{	switch (sendMe[j])
				{	case '0':
						tempP = variablePointer[0];
						break;
					case '1':
						tempP = variablePointer[1];
						break;
					case '2':
						tempP = variablePointer[2];
						break;
					case '3':
						tempP = variablePointer[3];
						break;
					case '4':
						tempP = variablePointer[4];
						break;
					case '5':
						tempP = variablePointer[5];
						break;
					case '6':
						tempP = variablePointer[6];
						break;
					case '7':
						tempP = variablePointer[7];
						break;
					default:
						tempP = -1;
						break;
				}
			}
			add--;				// Im Ausgabestring eine Stelle zurück (% überschreiben)
			if (tempP < 0) { UARTfinalString[j + add] = '-'; add++; tempP *= -1; }
			if (tempP == 0) { intBuf[intBufCtr++] = 48;; add++;}
			while (tempP) 		// Hier wird der Druckwert in die einzelnen Ziffern gesplittet
			{	intBuf[intBufCtr++] = asHex ? (tempP & 0x0F) + 48 : tempP % 10 + 48;// 48 ist 0 im ASCII code
				intBuf[intBufCtr-1] += (intBuf[intBufCtr-1]>57) ? 7 : 0 ;
				tempP = asHex ? tempP >>= 4 : tempP / 10;
			}

			for (h = 1; h <= intBufCtr; h++) // Ziffernfolge in korrekter Reihenfolge in den String schreiben
			{	nextChar = intBuf[intBufCtr - h];
				UARTfinalString[j + add] = nextChar;
				add++;			// Offset für Ausgabestring einen erhöhen pro gesetztem Zeichen
			}
			add--;				// da am Ende das letzte nextChar nochmal geschrieben wird, dieses Überschreiben (nicht doppelt einbauen)
			__no_operation();
		}
		else									// Ist kein %P oder %T aufgetreteten, Zeichen direkt verwenden
		{	nextChar = sendMe[j];
		}

		UARTfinalString[j + add] = nextChar;	// Zeichen in Ausgabestring schreiben an nächster Stelle
	}
	return j + add;								// Rückgabe der neuen Gesamtlänge, Info braucht der Interrupt
}

void display_print(char sendMe[], int x, int page, int varCount, ...)
{	// Parameter: String, Stringlänge, Anzahl der nachfolgenden Parameter (0-8), Liste der Parameter (nur int!!)

	display_setStartColumn(x);
	display_setStartPage(page);

	// String Länge bestimmen
	char *checkChar = sendMe;
	int varCountTotal = varCount;
	lengthDy = -1;
	while((!(checkChar == "\0")) && (lengthDy<25))
	{	lengthDy++;
		checkChar++;
	}

	va_list zusatzVariablen;
	if (varCount>8)
	{	varCount=8;
	} else if (varCount<0)
	{	varCount=0;
	}

	if (varCount)
	{	va_start(zusatzVariablen, varCount);
		while(varCount--)
		{	variablePointer[varCountTotal - varCount - 1] = va_arg(zusatzVariablen, int);
		}
		va_end(zusatzVariablen);
	}

	int byteCount = display_sendPrepare(sendMe, lengthDy, 1);	// String bearbeiten (ersetze %T mit temp und %P mit Druckmessergebnissen)
	unsigned char *nextChar = (unsigned char*) UARTfinalString;	// Für Interrupt, pointer auf Ausgabestring (gefüllt in UART_Send_Prepare)

	int i, j;
	I2C_setSlaveAdress(0x3C);
	I2C_start();
	UCB0TXBUF = 0x40;
	__delay_cycles(300);
	for (i=0; i<byteCount-1; i++){
		for (j=0; j<5; j++){
			UCB0TXBUF = Ascii[((unsigned short)*nextChar) - 32][j];
			__delay_cycles(300);
		}
		*nextChar++;
	}
	I2C_stop();
}

// draws a graph in an area, based on the values given
// avgOrBand: Draw a band from min to max value in
// axis values: add axis
void display_drawGraph(int *values, int count, int startX, int startY, int endX, int endY, int drawMode, int axisValues){
	int offset, i, *firstValue, min, max, carry;
	float posX, posY, scaleX, scaleY;

	firstValue = values;
	// set drawing areas
	display_setStartColumn(startX);
	display_setStartPage(startY>>3);
	offset = startY - ((startY >> 3) << 3);


	// find maximum, minimum and scale factors
	min = *firstValue;
	max = *firstValue;
	for (i=count; i>0;i--){
		if (*(firstValue+i) < min) { min = *(firstValue+i); }
		else if (*(firstValue+i) > max) { max = *(firstValue+i); }
	}

	scaleX = (endX - startX) / count;		// pixel per x
	scaleY = (endY - startY) / (max-min);	// pixel per y


}
